{
  "cisco_cdp_neighbor_labels": "Displays cisco discovery protocol information about neighbors in the Cisco switch.",
  "cisco_environment_fan_speed": "Displays fan speed.",
  "cisco_environment_fan_up": "Displays Present/Absent Status of the fan in the Cisco switch.",
  "cisco_environment_fan_zone_speed": "Displays the zone fan speed of the Cisco switch.",
  "cisco_environment_power_capacity": "Displays total capacity of the power supply in the Cisco switch.",
  "cisco_environment_power_in": "Displays actual input power in watts of power supply in the Cisco switch.",
  "cisco_environment_power_mode": "Displays redundant or operational Mode of power supply in the Cisco switch.",
  "cisco_environment_power_out": "Displays actual output power in watts of power supply in the Cisco switch.",
  "cisco_environment_power_up": "Displays power supply status in the Cisco switch.",
  "cisco_environment_sensor_temp": "Displays current temperature of sensor in the Cisco switch.",
  "cisco_interface_admin_up": "Displays admin state of the interface in the Cisco switch.",
  "cisco_interface_crc_errors": "Displays CRC of interface in the Cisco switch.",
  "cisco_interface_eth_out_discards": "Number of Ethernet output discarded packets in the Cisco switch.",
  "cisco_interface_receive_bytes": "Displays bytes input of the interface in the Cisco switch.",
  "cisco_interface_receive_drops": "Displays input if-down drops of interface in the Cisco switch.",
  "cisco_interface_receive_errors": "Displays input errors of interface in the Cisco switch.",
  "cisco_interface_transmit_bytes": "Displays bytes output of interface in the Cisco switch.",
  "cisco_interface_transmit_drops": "Displays output drops of interface in the Cisco switch.",
  "cisco_interface_transmit_errors": "Displays output errors of interface in the Cisco switch.",
  "cisco_lldp_neighbor_labels": "Displays link layer discovery protocol information about neighbours in the Cisco switch.",
  "cisco_optic_rx": "Displays rx power of the interface in the Cisco switch.",
  "cisco_optic_tx": "Displays tx power of the interface in the Cisco switch.",
  "cisco_switch_labels": "Displays configuration detail of the Cisco switch.",
  "cisco_switch_uptime": "Displays uptime duration of the Cisco switch."
}
